## Plan Result (prod_enterprise - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 38 to add, 3 to change, 15 to destroy.</code></pre>

* Create
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Security&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Security&#34;]
* Update
  * module.enterprise.azurerm_management_group.level_3[&#34;Platform-NonProd&#34;]
  * module.enterprise.azurerm_management_group.level_3[&#34;Platform-Sandbox&#34;]
  * module.enterprise.azurerm_management_group.level_3[&#34;SDS-Sandbox&#34;]
* Delete
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_subscription.this
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_subscription.this
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_subscription.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.azurerm_management_group.level_3["Platform-NonProd"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/Platform-NonProd"
        name                       = "Platform-NonProd"
      ~ subscription_ids           = [
          - "b50cfb90-d6cd-4e78-97e6-cb7958335b6e",
          - "ba3c6fcf-22b1-4a11-9080-1cf965c060e9",
            # (3 unchanged elements hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.enterprise.azurerm_management_group.level_3["Platform-Sandbox"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox"
        name                       = "Platform-Sandbox"
      ~ subscription_ids           = [
          - "5709598c-3a1c-4535-8979-f10948b9a031",
            # (4 unchanged elements hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.enterprise.azurerm_management_group.level_3["SDS-Sandbox"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox"
        name                       = "SDS-Sandbox"
      ~ subscription_ids           = [
          - "0c1744f8-9e63-4742-9c28-c066fd2e6eee",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.subscription["DCD-MI-SBOX"].azurerm_subscription.this will be destroyed
  # (because module.subscription["DCD-MI-SBOX"] is not in configuration)
  - resource "azurerm_subscription" "this" {
      - alias             = "DCD-MI-SBOX" -> null
      - billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/233705" -> null
      - id                = "/providers/Microsoft.Subscription/aliases/DCD-MI-SBOX" -> null
      - subscription_id   = "0c1744f8-9e63-4742-9c28-c066fd2e6eee" -> null
      - subscription_name = "DCD-MI-SBOX" -> null
      - tags              = {} -> null
      - tenant_id         = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Azure Kubernetes Service Cluster Admin Role"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids        = [] -> null
      - assignable_to_role             = false -> null
      - auto_subscribe_new_members     = false -> null
      - behaviors                      = [] -> null
      - description                    = "Grants aks cluster admin permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name                   = "DTS AKS Administrators (sub:dts-management-sbox)" -> null
      - external_senders_allowed       = false -> null
      - hide_from_address_lists        = false -> null
      - hide_from_outlook_clients      = false -> null
      - id                             = "/groups/cf13cae2-da9c-4219-a5af-8ec197064a41" -> null
      - mail_enabled                   = false -> null
      - mail_nickname                  = "0e62ed21-25b6-46f3-bb13-1008a2a7c45b" -> null
      - members                        = [] -> null
      - object_id                      = "cf13cae2-da9c-4219-a5af-8ec197064a41" -> null
      - onpremises_sync_enabled        = false -> null
      - owners                         = [] -> null
      - prevent_duplicate_names        = true -> null
      - provisioning_options           = [] -> null
      - proxy_addresses                = [] -> null
      - security_enabled               = true -> null
      - types                          = [] -> null
      - writeback_enabled              = false -> null
        # (9 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids        = [] -> null
      - assignable_to_role             = false -> null
      - auto_subscribe_new_members     = false -> null
      - behaviors                      = [] -> null
      - description                    = "Grants aks cluster user permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name                   = "DTS AKS Users (sub:dts-management-sbox)" -> null
      - external_senders_allowed       = false -> null
      - hide_from_address_lists        = false -> null
      - hide_from_outlook_clients      = false -> null
      - id                             = "/groups/9390da56-b5ae-4aba-995a-c682f2e1d763" -> null
      - mail_enabled                   = false -> null
      - mail_nickname                  = "4ba2e462-dcaf-4821-9303-e65cb2d35ae6" -> null
      - members                        = [] -> null
      - object_id                      = "9390da56-b5ae-4aba-995a-c682f2e1d763" -> null
      - onpremises_sync_enabled        = false -> null
      - owners                         = [] -> null
      - prevent_duplicate_names        = true -> null
      - provisioning_options           = [] -> null
      - proxy_addresses                = [] -> null
      - security_enabled               = true -> null
      - types                          = [] -> null
      - writeback_enabled              = false -> null
        # (9 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Contributor"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids        = [] -> null
      - assignable_to_role             = false -> null
      - auto_subscribe_new_members     = false -> null
      - behaviors                      = [] -> null
      - description                    = "Grants contributor permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name                   = "DTS Contributors (sub:dts-management-sbox)" -> null
      - external_senders_allowed       = false -> null
      - hide_from_address_lists        = false -> null
      - hide_from_outlook_clients      = false -> null
      - id                             = "/groups/90ac3da9-9ae7-4849-8a49-e2fe903dd223" -> null
      - mail_enabled                   = false -> null
      - mail_nickname                  = "4c58b0d9-2f3c-4207-b69f-e9847a19b69f" -> null
      - members                        = [
          - "89f89bfe-3183-4d01-868c-29f7303580d9",
        ] -> null
      - object_id                      = "90ac3da9-9ae7-4849-8a49-e2fe903dd223" -> null
      - onpremises_sync_enabled        = false -> null
      - owners                         = [] -> null
      - prevent_duplicate_names        = true -> null
      - provisioning_options           = [] -> null
      - proxy_addresses                = [] -> null
      - security_enabled               = true -> null
      - types                          = [] -> null
      - writeback_enabled              = false -> null
        # (9 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Key Vault Administrator"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids        = [] -> null
      - assignable_to_role             = false -> null
      - auto_subscribe_new_members     = false -> null
      - behaviors                      = [] -> null
      - description                    = "Grants key vault administrator permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name                   = "DTS Key Vault Administrators (sub:dts-management-sbox)" -> null
      - external_senders_allowed       = false -> null
      - hide_from_address_lists        = false -> null
      - hide_from_outlook_clients      = false -> null
      - id                             = "/groups/ec9b048f-bd1f-4f23-b320-ef8259abd188" -> null
      - mail_enabled                   = false -> null
      - mail_nickname                  = "6a6c045c-b" -> null
      - members                        = [] -> null
      - object_id                      = "ec9b048f-bd1f-4f23-b320-ef8259abd188" -> null
      - onpremises_sync_enabled        = false -> null
      - owners                         = [
          - "0ec60e03-4262-44ce-abcf-83e2131c9207",
        ] -> null
      - prevent_duplicate_names        = true -> null
      - provisioning_options           = [] -> null
      - proxy_addresses                = [] -> null
      - security_enabled               = true -> null
      - types                          = [] -> null
      - writeback_enabled              = false -> null
        # (9 unchanged attributes hidden)
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Owner"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids        = [] -> null
      - assignable_to_role             = false -> null
      - auto_subscribe_new_members     = false -> null
      - behaviors                      = [] -> null
      - description                    = "Grants owner permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name                   = "DTS Owners (sub:dts-management-sbox)" -> null
      - external_senders_allowed       = false -> null
      - hide_from_address_lists        = false -> null
      - hide_from_outlook_clients      = false -> null
      - id                             = "/groups/89f89bfe-3183-4d01-868c-29f7303580d9" -> null
      - mail_enabled                   = false -> null
      - mail_nickname                  = "2f447054-25e3-477e-a926-2e2e6478ee4b" -> null
      - members                        = [] -> null
      - object_id                      = "89f89bfe-3183-4d01-868c-29f7303580d9" -> null
      - onpremises_sync_enabled        = false -> null
      - owners                         = [] -> null
      - prevent_duplicate_names        = true -> null
      - provisioning_options           = [] -> null
      - proxy_addresses                = [] -> null
      - security_enabled               = true -> null
      - types                          = [] -> null
      - writeback_enabled              = false -> null
        # (9 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Reader"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids        = [] -> null
      - assignable_to_role             = false -> null
      - auto_subscribe_new_members     = false -> null
      - behaviors                      = [] -> null
      - description                    = "Grants reader permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name                   = "DTS Readers (sub:dts-management-sbox)" -> null
      - external_senders_allowed       = false -> null
      - hide_from_address_lists        = false -> null
      - hide_from_outlook_clients      = false -> null
      - id                             = "/groups/99e37c67-ca37-4922-9b32-f1db7b7acefe" -> null
      - mail_enabled                   = false -> null
      - mail_nickname                  = "8d705cdd-eaff-43c1-b420-31089f5a917e" -> null
      - members                        = [] -> null
      - object_id                      = "99e37c67-ca37-4922-9b32-f1db7b7acefe" -> null
      - onpremises_sync_enabled        = false -> null
      - owners                         = [] -> null
      - prevent_duplicate_names        = true -> null
      - provisioning_options           = [] -> null
      - proxy_addresses                = [] -> null
      - security_enabled               = true -> null
      - types                          = [] -> null
      - writeback_enabled              = false -> null
        # (9 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Security Reader"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids        = [] -> null
      - assignable_to_role             = false -> null
      - auto_subscribe_new_members     = false -> null
      - behaviors                      = [] -> null
      - description                    = "Grants security reader permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name                   = "DTS Security Readers (sub:dts-management-sbox)" -> null
      - external_senders_allowed       = false -> null
      - hide_from_address_lists        = false -> null
      - hide_from_outlook_clients      = false -> null
      - id                             = "/groups/07acdc23-a6b1-4db9-a38e-0a41e2159e08" -> null
      - mail_enabled                   = false -> null
      - mail_nickname                  = "0d648d86-2" -> null
      - members                        = [] -> null
      - object_id                      = "07acdc23-a6b1-4db9-a38e-0a41e2159e08" -> null
      - onpremises_sync_enabled        = false -> null
      - owners                         = [
          - "0ec60e03-4262-44ce-abcf-83e2131c9207",
        ] -> null
      - prevent_duplicate_names        = true -> null
      - provisioning_options           = [] -> null
      - proxy_addresses                = [] -> null
      - security_enabled               = true -> null
      - types                          = [] -> null
      - writeback_enabled              = false -> null
        # (9 unchanged attributes hidden)
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Storage Blob Data Reader"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids        = [] -> null
      - assignable_to_role             = false -> null
      - auto_subscribe_new_members     = false -> null
      - behaviors                      = [] -> null
      - description                    = "Grants storage blob data contributor permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name                   = "DTS Blob Readers (sub:dts-management-sbox)" -> null
      - external_senders_allowed       = false -> null
      - hide_from_address_lists        = false -> null
      - hide_from_outlook_clients      = false -> null
      - id                             = "/groups/d0a28f71-5f71-42e6-aaaf-1cacb1ec67f5" -> null
      - mail_enabled                   = false -> null
      - mail_nickname                  = "a4ee6c9b-bd68-1b5c-f5c5-9297ad25b500" -> null
      - members                        = [] -> null
      - object_id                      = "d0a28f71-5f71-42e6-aaaf-1cacb1ec67f5" -> null
      - onpremises_sync_enabled        = false -> null
      - owners                         = [] -> null
      - prevent_duplicate_names        = true -> null
      - provisioning_options           = [] -> null
      - proxy_addresses                = [] -> null
      - security_enabled               = true -> null
      - types                          = [] -> null
      - writeback_enabled              = false -> null
        # (9 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azurerm_key_vault.kv will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azurerm_key_vault" "kv" {
      - access_policy                   = [
          - {
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "7a620133-7346-4291-b7fe-8d69e1cfc356"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
          - {
              - certificate_permissions = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "GetIssuers",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "DeleteIssuers",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                ]
              - object_id               = "a7ade81c-aa77-4bd3-9146-ef448c86c855"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
          - {
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "dad693c4-36ad-468f-94e9-76faa4bc844b"
              - secret_permissions      = [
                  - "Get",
                  - "Set",
                  - "List",
                  - "Delete",
                  - "Restore",
                  - "Recover",
                  - "Backup",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
          - {
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "0e6b530c-57aa-4fa3-8352-bad1dfe05884"
              - secret_permissions      = [
                  - "List",
                  - "Get",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
          - {
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "0ec60e03-4262-44ce-abcf-83e2131c9207"
              - secret_permissions      = [
                  - "List",
                  - "Set",
                  - "Get",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            }

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

   = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor["SDS-Prod"] will be created
  + resource "azuread_group" "storage_blob_data_contributor" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Storage Blob Data Contributor (mg:SDS-Prod)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor["SDS-Sandbox"] will be created
  + resource "azuread_group" "storage_blob_data_contributor" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Storage Blob Data Contributor (mg:SDS-Sandbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor["Security"] will be created
  + resource "azuread_group" "storage_blob_data_contributor" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Storage Blob Data Contributor (mg:Security)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["CFT"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["CFT-NonProd"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["CFT-Prod"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["CFT-Sandbox"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Crime"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Crime"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["HMCTS"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Heritage"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Heritage-NonProd"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Heritage-Prod"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Heritage-Sandbox"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Platform"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Platform-NonProd"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Platform-Prod"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Platform-Sandbox"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["SDS"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["SDS-NonProd"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["SDS-Prod"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["SDS-Sandbox"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Security"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Security"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 38 to add, 3 to change, 15 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":114,"Program":"tfcmt","SHA1":"","Target":"prod_enterprise - TerraformPlanApply","Vars":{}} -->